In [1]:
import pandas as pd

In [2]:
series = pd.Series(['Samsung', 'Apple', 'huawie'])
series

0    Samsung
1      Apple
2     huawie
dtype: object

In [3]:
colours = pd.Series(['Red','Green', 'Blue'])
colours

0      Red
1    Green
2     Blue
dtype: object

In [4]:
data_frame = pd.DataFrame({'Brand':series, 'Colours':colours})
data_frame

     Brand Colours
0  Samsung     Red
1    Apple   Green
2   huawie    Blue

In [8]:
# importing data csv
df = pd.read_csv('car-sales.csv')
df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [ ]:
df.to_csv('cars-sales.csv')
df.to_excel('cars-sales.csv')

## Discribing Data

In [9]:
# attributes
df.dtypes # after dot attributes have to brackets

# methods
# df.to_csv() after dot method have brackets

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [10]:
df.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [11]:
df_columns = df.columns
df_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [12]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [18]:
df.describe()
# describe works only on integer value

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [20]:
df.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [21]:
df['Doors'].mean()

4.0

In [22]:
df.Doors.mean()

4.0

In [23]:
df.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [24]:
df.Doors.sum()

40

In [25]:
len(df)

10

## Viewing and Selecting Data

In [26]:
df.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [27]:
df.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [28]:
# loc and iloc
animals = pd.Series(['cats','dogs', 'humans', 'monkeys', 'snake'])
animals

0       cats
1       dogs
2     humans
3    monkeys
4      snake
dtype: object

In [45]:
# loc refer to location

# iloc refer to position

In [30]:
animals.loc[4]

'snake'

In [31]:
df.loc[8]

Make                Toyota
Colour               White
Odometer (KM)        60000
Doors                    4
Price            $6,250.00
Name: 8, dtype: object

In [44]:
df.Doors.loc[5]

4

In [41]:
df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [46]:
animals.iloc[3]

'monkeys'

In [47]:
animals

0       cats
1       dogs
2     humans
3    monkeys
4      snake
dtype: object

In [48]:
df.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

## Slicing

In [49]:
df.iloc[:5]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [52]:
df.Make.iloc[:4]

0    Toyota
1     Honda
2    Toyota
3       BMW
Name: Make, dtype: object

In [54]:
df[df['Make'] == 'BMW']

  Make Colour  Odometer (KM)  Doors       Price
3  BMW  Black          11179      5  $22,000.00

In [55]:
df[df['Doors'] > 4]

  Make Colour  Odometer (KM)  Doors       Price
3  BMW  Black          11179      5  $22,000.00